const text = [
  'Какое умное сообщение!',
  'Пизданул знатно...',
  'Правда думаешь что другие оценят?',
  'Смешно пиздец',
  'Надо бы тебя забанить...',
  '0_0',
  '=_=',
  '^_^',
  'Действительно горячо....',
  'Ты долго думал?',
  'Давай ещё, шишак колом',
];

const mediaGroup = [
  'Вот это наборчик!',
  'Люблю когда много...',
  'Больше! Нужно больше!',
  'Настоящая коллекция!',
  'Я смотрю ты прям разбираешься...',
  'Спасибо за конь тент',
  'Короче дроченный',
];

const photo = [
  'Всего одна картиночка...',
  'Ну ты и жадина',
  'Бакаааааааааааааа',
  'Давай ещё, ну пожааалуйста',
  'Нужно больше контента',
  'Постарайся, я знаю ты можешь лучше',
  'Где остальное?',
  'Куда спрятал кадры, а!?',
];

const video = [
  'Ух, вот это видосик!',
  'Видосики я люблю',
  'Сколько кадров!?',
  'О, мой любимый персонаж',
  'А почему не наборчиком?...',
  'И где ты их только берёшь...',
  'А можно сразу все?',
];

const document = [
  'Это что вообще такое?',
  'Ничего не понимаю, но допустим',
  'Откуда ты это взял?',
  'Последний раз я смотрел это на ucozе',
  'Где-то я это видел...',
  'Ты что дедушка?',
];

const audio = [
  'Что это за звук?',
  'Зачем это... но ладно',
  'Какой приятный голос!',
  'Уга буга',
  'Срочно заливаем на spotify',
  'Как тебе пришла в голову такая идея?',
  'Ну ты прям этот... прадюссэр',
];

const getRandom = <T>(arr: T[]): string => (arr[Math.floor(Math.random() * arr.length)] ?? 'Не нашёл что ответить из базы :c') as string;

export default {
  getRandomText: () => getRandom<string>(text),
  getRandomMediaGroupText: () => getRandom<string>(mediaGroup),
  getRandomPhotoText: () => getRandom<string>(photo),
  getRandomVideoText: () => getRandom<string>(video),
  getRandomDocumentText: () => getRandom<string>(document),
  getRandomAudioText: () => getRandom<string>(audio),
};
